'use strict'

// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// let arr = ['a', 'b', 'c'];

// let newArr = [1, 2, 3];

// console.log(arr.concat(newArr));

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

// let arr = ['a', 'b', 'c'];
// arr.push(1, 2, 3);
// console.log(arr);


// 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// let arr = [1, 2, 3];
// let arr2 = [4, 5, 6];

// console.log(arr.concat(arr2));


// 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const arr  = [1, 2, 3];
// console.log(arr.reverse());


// 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// const arr = [1,2,3];
// arr.push(4,5,6);
// console.log(arr);

// 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// const arr = [1,2,3];
// arr.unshift(4,5,6);
// console.log(arr);

// 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const arr = ["js", "css", 'jq']
// console.log(arr[0]);

// 8) Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const arr = ['js', 'css', 'jq'];
// console.log(arr[2]);

// 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// const arr = [1, 2, 3, 4, 5];
// let newArr = arr.slice(0,3);
// console.log(newArr);

// 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. Скрыть решение.

// const arr = [1, 2, 3, 4, 5];
// let newArr = arr.slice(3);
// console.log(newArr);

// 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(1,2);
// console.log(arr);

// 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. Показать решение.

// const arr = [1, 2, 3, 4, 5];
// let newArr = arr.splice(1,3);
// console.log(newArr);

// 13) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. Показать решение.

// const arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// console.log(arr);

// 14) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. Показать решение. (edited)
// const arr = [1, 2, 3, 4, 5];
// arr.splice(1,0,'a','b');
// arr.splice(6,0,'c');
// arr.splice(8,0,'e');
// console.log(arr);

// ========================================================

// // 1) Вибираємо випадкове число (від 0 до довжини масива);

// const arr = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'];
// let random = Math.floor(Math.random() * arr.length);
// console.log(arr[random]);

// // 2) Записати в змінну звернення типу масив[індекс];

// const arr = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'];
// let something = arr[7];
// console.log(something);

// // 3) Вивести змінну з пунтку 2 в алерт;
// 1) Через prompt вводимо свій варіант тваринки
// 2) Варіант компютера записати в змінну
// 3) Порівнюємо наш варіант з копютерним
// 3,1) Якщо варіанти співпали тоді виводимо алертом що юзер виграва.
// 3,2) Якщо варіанти не співпали кажемо що користувач програв і виводимо варіант компютера.

// const animals = ['dog', 'cat', "fish", 'rabbit', 'tiger'];
// let index = Math.floor(Math.random()*animals.length);
// // alert(animals[index]);
// let userInput = prompt('Введите животное');

// userInput === animals[index] ? alert("you'r win") : alert(`you'r loose, right choice ${animals[index]}`);

// ========================================================

// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера. 
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.

// const arr = ['камень', 'ножници', 'бумага'];
// let random = Math.floor(Math.random() * arr.length);
// let pc = arr[random];
// let userInput = prompt("камень, ножници, бумага");
// if (userInput === pc) {
//     alert('ничья');
// } else if (userInput === arr[1] && pc === arr[2] || userInput === arr[2] && pc === arr[0] || userInput === arr[0] && pc === arr[1]) {
//     alert(`вы победили, ваш выбор ${userInput}, выбор компьютера ${pc}`);
// } else if (userInput === arr[2] && pc === arr[1] || userInput === arr[0] && pc === arr[2] || userInput === arr[1] && pc === arr[0]) {
//     alert(`вы проиграли, ваш выбор ${userInput}, выбор компьютера ${pc}`);
// } else {
//     alert('соблюдайте правила');
// }
// ========================================================

// 1) Записуємо в змінну строку з промта
// const ask = prompt('somthing');
// console.log(ask);
// // 2) Зробити строку масивом
// let arr = ask.split('')
// // 3) Скопіювати масив
// let newArr = arr.slice();
// // 4) Реверсимо масив
// newArr.reverse();
// // 5) З масивів робимо строки
// let str = newArr.join()
// // 6) Порівнюємо дві строки і виводимо результат в консоль;
// console.log(ask);
// console.log(str);


// ==========================================================

// let logins = ['rew', 'qwewwe', 'apple', 'js', 'row', 'col']

// // 1) Запитати логін
// let askLogin = prompt('Введите логин');
// // 2) Перевірити чи існує логін в базі
// logins.includes(askLogin) ? alert("Такий логін вже існує") : alert("Вітаємо");
// // 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// // 4) Якщо логін не існує вивести алерт ("Вітаємо") 

// ==========================================================